Zektopic/ESP32-CAM_MJPEG2SD/webServer.cpp
static esp_err_t webHandler(httpd_req_t* req) {
  if (!checkAuth(req)) return ESP_OK;
  // return required web page or component to browser using filename from query string
  size_t queryLen = httpd_req_get_url_query_len(req) + 1;
  if (queryLen > FILE_NAME_LEN) {
    LOG_ERR("Query string too long");
    httpd_resp_set_status(req, "400 Invalid query string");
    httpd_resp_sendstr(req, NULL);
    return ESP_FAIL;
  }
  httpd_req_get_url_query_str(req, variable, queryLen);
  urlDecode(variable);

  if (isPathTraversal(variable)) {
    LOG_WRN("Path traversal attempt detected in URL query: %s", variable);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  // check file extension to determine required processing before response sent to browser
  size_t varLen = strlen(variable); // Bolt: Cache length to prevent O(N^2) behavior in if/else chain
  if (!strcmp(variable, "OTA.htm")) {
    // request for built in OTA page, if index html defective
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_sendstr(req, otaPage_html);
  // ⚡ Bolt optimization: Use compile-time `sizeof(EXT) - 1` instead of `strlen` to avoid repeated string traversal overhead.
  } else if (varLen >= (sizeof(HTML_EXT) - 1) && !strcmp(HTML_EXT, variable+(varLen-(sizeof(HTML_EXT) - 1)))) {
    // any other html file
    httpd_resp_set_type(req, "text/html");
  } else if (varLen >= (sizeof(JS_EXT) - 1) && !strcmp(JS_EXT, variable+(varLen-(sizeof(JS_EXT) - 1)))) {
    // any js file
    httpd_resp_set_type(req, "text/javascript");
  } else if (varLen >= (sizeof(CSS_EXT) - 1) && !strcmp(CSS_EXT, variable+(varLen-(sizeof(CSS_EXT) - 1)))) {
    // any css file
    httpd_resp_set_type(req, "text/css");
  } else if (varLen >= (sizeof(TEXT_EXT) - 1) && !strcmp(TEXT_EXT, variable+(varLen-(sizeof(TEXT_EXT) - 1)))) {
    // any text file
    httpd_resp_set_type(req, "text/plain");
  } else if (varLen >= (sizeof(ICO_EXT) - 1) && !strcmp(ICO_EXT, variable+(varLen-(sizeof(ICO_EXT) - 1)))) {
    // any icon file
    httpd_resp_set_type(req, "image/x-icon");
  } else if (varLen >= (sizeof(SVG_EXT) - 1) && !strcmp(SVG_EXT, variable+(varLen-(sizeof(SVG_EXT) - 1)))) {
    // any svg file
    httpd_resp_set_type(req, "image/svg+xml");
  } else LOG_WRN("Unknown file type %s", variable);

  if (isPathTraversal(variable)) {
    LOG_WRN("Path traversal attempt detected before formatting: %s", variable);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  int dlen = snprintf(inFileName, IN_FILE_NAME_LEN - 1, "%s/%s", DATA_DIR, variable);
  if (dlen >= IN_FILE_NAME_LEN) LOG_WRN("file name truncated");
  if (isPathTraversal(inFileName)) {
    LOG_WRN("Path traversal attempt detected in formatted path: %s", inFileName);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  return fileHandler(req);
}

static esp_err_t controlHandler(httpd_req_t *req) {
  // process control query from browser
  // obtain details from query string
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  if (!checkAuth(req)) return ESP_OK;
  if (extractQueryKeyVal(req, variable, value, sizeof(value)) != ESP_OK) return ESP_FAIL;
  if (!strcmp(variable, "displayLog")) displayLog(req);
  else {
    // extractQueryKeyVal already populated value
    if (!strcmp(variable, "reset")) {
      httpd_resp_sendstr(req, NULL); // stop browser resending reset
      doRestart(value);
      return ESP_OK;
    }
    if (!strcmp(variable, "startOTA")) snprintf(inFileName, IN_FILE_NAME_LEN - 1, "%s/%s", DATA_DIR, value);
    else {
      // if not handled by appSpecificWebHandler(), try updateStatus()
      if (appSpecificWebHandler(req, variable, value) == ESP_FAIL) updateStatus(variable, value);
    }
  }
  httpd_resp_sendstr(req, NULL);
  return ESP_OK;
}

static esp_err_t statusHandler(httpd_req_t *req) {
  if (!checkAuth(req)) return ESP_OK;
  uint8_t filter = (uint8_t)httpd_req_get_url_query_len(req); // filter number is length of query string
  buildJsonString(filter);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_sendstr(req, jsonBuff);
  return ESP_OK;
}

bool parseJson(int rxSize) {
  if (rxSize <= 0 || rxSize >= JSON_BUFF_LEN) return false;
  // process json in jsonBuff to extract properly formatted flat key:value pairs
  jsonBuff[rxSize - 1] = ','; // replace final '}'
  jsonBuff[rxSize] = 0; // terminator
  char* ptr = jsonBuff + 1; // skip over initial '{'
  size_t itemLen = 0;
  bool retAction = false;
  do {
    // get and process each key:value in turn
    char* endItem = strchr(ptr += itemLen, ':');
    if (!endItem) break;
    itemLen = endItem - ptr;
    size_t copyLen = std::min(itemLen, (size_t)(FILE_NAME_LEN - 1));
    memcpy(variable, ptr, copyLen);
    variable[copyLen] = 0;
    removeChar(variable, '"');
    ptr++;
    endItem = strchr(ptr += itemLen, ',');
    if (!endItem) break;
    itemLen = endItem - ptr;
    copyLen = std::min(itemLen, (size_t)(IN_FILE_NAME_LEN - 1));
    memcpy(value, ptr, copyLen);
    value[copyLen] = 0;
    removeChar(value, '"');
    ptr++;
    if (!strcmp(variable, "action")) {
      strncpy(retainAction, value, sizeof(retainAction) - 1);
      retainAction[sizeof(retainAction) - 1] = 0;
      retAction = true;
    } else updateStatus(variable, value);
  } while (ptr + itemLen - jsonBuff < rxSize);
  return retAction;
}

static esp_err_t sseHandler(httpd_req_t *req) {
  if (!checkAuth(req)) return ESP_OK;
  // enable Server Sent Events
  const char sseHeader[] = "HTTP/1.1 200 OK\r\n"
                           "Cache-Control: no-store\r\n"
                           "Connection: keep-alive\r\n"
                           "Content-Type: text/event-stream\r\n\r\n";
  sseSocketHD = req->handle;
  sseSocketFD = httpd_req_to_sockfd(req);
  httpd_socket_send(sseSocketHD, sseSocketFD, sseHeader, sizeof(sseHeader) - 1, 0);
  sendSSE("open", "opened");
  return ESP_OK;
}

#define SSESEP "\r\n\r\n" // SSE event separator
void sendSSE(const char* eventType, const char* eventData) {
  // send event data to browser
  if (sseSocketFD > 0) {
    char eventMsg[30];
    int msgLen = snprintf(eventMsg, sizeof(eventMsg), "event: %s\ndata: ", eventType);
    if (msgLen >= sizeof(eventMsg)) msgLen = sizeof(eventMsg) - 1;
    int res = httpd_socket_send(sseSocketHD, sseSocketFD, eventMsg, msgLen, 0);
    res = httpd_socket_send(sseSocketHD, sseSocketFD, eventData, strlen(eventData), 0);
    res = httpd_socket_send(sseSocketHD, sseSocketFD, SSESEP, (sizeof(SSESEP) - 1), 0);
    if (res == HTTPD_SOCK_ERR_TIMEOUT) LOG_WRN("Timeout/interrupted while using socket");
    if (res == HTTPD_SOCK_ERR_FAIL) LOG_WRN("Unrecoverable error while using socket");
    if (res == HTTPD_SOCK_ERR_INVALID) LOG_WRN("Invalid arguments %s, %s", eventType, eventData);
  } else LOG_ERR("SSE not initiated");
}

static esp_err_t updateHandler(httpd_req_t *req) {
  if (!checkAuth(req)) return ESP_OK;
  // bulk update of config, extract key pairs from received json string
  size_t rxSize = min(req->content_len, (size_t)JSON_BUFF_LEN);
  int ret = 0;
  // obtain json payload
  do {
    ret = httpd_req_recv(req, jsonBuff, rxSize);
    if (ret < 0) {
      if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
      else {
        LOG_WRN("Update request failed with status %i", ret);
      }
    }
  } while (ret > 0);
  httpd_resp_sendstr(req, NULL);
  if (ret >= 0 && parseJson(rxSize)) appSpecificWebHandler(req, "action", retainAction);
  return ret < 0 ? ESP_FAIL : ESP_OK;
}

void progress(size_t prg, size_t sz) {
  static uint8_t pcProgress = 0;
  if (calcProgress(prg, sz, 5, pcProgress)) LOG_INF("OTA uploaded %d%%", pcProgress);
}

esp_err_t uploadHandler(httpd_req_t *req) {
  if (!checkAuth(req)) return ESP_OK;
  // upload file for storage or firmware update
  esp_err_t res = ESP_OK;
  size_t fileSize = req->content_len;
  size_t rxSize = min(fileSize, (size_t)JSON_BUFF_LEN);
  int bytesRead = -1;
  LOG_INF("Upload file %s", inFileName);

  urlDecode(inFileName);
  if (isPathTraversal(inFileName)) {
    LOG_WRN("Path traversal attempt detected in upload: %s", inFileName);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  if (strstr(inFileName, ".bin") != NULL) {
    // partition update - sketch or SPIFFS
    LOG_INF("Firmware update using file %s", inFileName);
    OTAprereq();
    if (fdWs >= 0) httpd_sess_trigger_close(httpServer, fdWs);
    // a spiffs binary must have 'spiffs' in the filename
    int cmd = (strstr(inFileName, "spiffs") != NULL) ? U_SPIFFS : U_FLASH;
    if (cmd == U_SPIFFS) STORAGE.end(); // close relevant file system
    if (Update.begin(UPDATE_SIZE_UNKNOWN, cmd)) {
      do {
        bytesRead = httpd_req_recv(req, jsonBuff, rxSize);
        if (bytesRead < 0) {
          if (bytesRead == HTTPD_SOCK_ERR_TIMEOUT) {
            delay(10);
            continue;
          } else {
            LOG_WRN("Upload request failed with status %i", bytesRead);
            break;
          }
        }
        Update.write((uint8_t*)jsonBuff, (size_t)bytesRead);
        Update.onProgress(progress);
        fileSize -= bytesRead;
      } while (bytesRead > 0);
      if (!fileSize) Update.end(true); // true to set the size to the current progress
    }
    if (Update.hasError()) LOG_WRN("OTA failed with error: %s", Update.errorString());
    else LOG_INF("OTA update complete for %s", cmd == U_FLASH ? "Sketch" : "SPIFFS");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_sendstr(req, Update.hasError() ? "OTA update failed, restarting ..." : "OTA update complete, restarting ...");
    doRestart("Restart after OTA");

  } else {
    // create / replace data file on storage
    File uf = STORAGE.open(inFileName, FILE_WRITE);
    if (!uf) LOG_WRN("Failed to open %s on storage", inFileName);
    else {
      // obtain file content
      do {
        bytesRead = httpd_req_recv(req, jsonBuff, rxSize);
        if (bytesRead < 0) {
          if (bytesRead == HTTPD_SOCK_ERR_TIMEOUT) {
            delay(10);
            continue;
          } else {
            LOG_WRN("Upload request failed with status %i", bytesRead);
            break;
          }
        }
        uf.write((const uint8_t*)jsonBuff, bytesRead);
      } while (bytesRead > 0);
      uf.close();
      res = bytesRead < 0 ? ESP_FAIL : ESP_OK;
      httpd_resp_sendstr(req, res == ESP_OK ? "Completed upload file" : "Failed to upload file, retry");
      if (res == ESP_OK) LOG_INF("Uploaded file %s", inFileName);
      else LOG_WRN("Failed to upload file %s", inFileName);
    }
  }
  return res;
}

static esp_err_t setupHandler(httpd_req_t *req) {
  if (!checkAuth(req)) return ESP_OK;
  // Scan for WiFi networks
  int w = (netMode == 0) ? WiFi.scanNetworks() : 0;
  // Start building the JSON string
  char* p = jsonBuff;
  size_t rem = JSON_BUFF_LEN;
  int n = snprintf(p, rem, "{\"networks\":[");
  if (n > 0 && n < rem) { p += n; rem -= n; }
  // Populate the JSON string with scan results
  for (int i = 0; i < w; ++i) {
    n = snprintf(p, rem, "{\"ssid\":\"%s\",\"encryption\":\"%s\",\"strength\":\"%ld\"},", WiFi.SSID(i).c_str(), getEncType(i), WiFi.RSSI(i));
    if (n > 0 && (size_t)n + 2 < rem) {
      p += n;
      rem -= n;
    } else {
      break;
    }
  }
  // remove final comma and close the JSON array
  if (p > jsonBuff && *(p - 1) == ',') { p--; rem++; } // step back over comma
  snprintf(p, rem, "]}");
  // Set the response type to JSON and send JSON
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
  httpd_resp_sendstr(req, jsonBuff);
  return ESP_OK;
}

void showHttpHeaders(httpd_req_t *req) {
  // httpd_req_aux struct members hidden so need to access them via offsets
  // to calculate offset any element not on 4 byte boundary has to be packed
  LOG_DBG("HTTP: %s %s", HTTP_METHOD_STRING(req->method), req->uri);
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  size_t maxHdrLen = max(CONFIG_HTTPD_MAX_REQ_HDR_LEN, CONFIG_HTTPD_MAX_URI_LEN);
#else
  size_t maxHdrLen = max(HTTPD_MAX_REQ_HDR_LEN, HTTPD_MAX_URI_LEN);
#endif
  uint32_t req_hdrs_count = *((uint8_t*)req->aux + 4 + maxHdrLen + 1 + 3 + 4 + 4 + 4 + 1 + 3);
  char* header = (char*)req->aux + 4; // start of scratch buffer containing headers
  // get each header string in turn
  while (req_hdrs_count--) {
    LOG_DBG("  %s", header);
    header += strlen(header) + 2;
  }
}

static esp_err_t sendCrossOriginHeader(httpd_req_t *req) {
  // prevent CORS from blocking request
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Access-Control-Max-Age", "600");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST,GET,HEAD,OPTIONS");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "*");
  httpd_resp_set_status(req, "204");
  httpd_resp_sendstr(req, NULL);
  return ESP_OK;
}

static bool checkWsSocketStatus() {
  // Check if connection is active and is a WebSocket
  return (httpd_ws_get_fd_info(httpServer, fdWs) == HTTPD_WS_CLIENT_WEBSOCKET) ? true : false;
}

bool wsAsyncSendText(const char* wsData) {
  // websockets send text function, used for async logging and status updates
  if (checkWsSocketStatus()) {
    // send if connection active
    httpd_ws_frame_t wsPkt;
    wsPkt.payload = (uint8_t*)wsData;
    wsPkt.len = strlen(wsData);
    wsPkt.type = HTTPD_WS_TYPE_TEXT;
    wsPkt.final = true;
    esp_err_t ret = httpd_ws_send_frame_async(httpServer, fdWs, &wsPkt);
    if (ret != ESP_OK) LOG_WRN("websocket send failed with %s", esp_err_to_name(ret));
    return ret == ESP_OK ? true : false;
  }
  return false;
}

bool wsAsyncSendJson(const char* dataType, const char* wsData) {
  if (!dataType || !wsData) return false;
  // calculate exact size needed
  int reqLen = snprintf(NULL, 0, "{\"type\":\"%s\",\"payload\":{%s}}", dataType, wsData);
  if (reqLen < 0) return false;

