Zektopic/ESP32-CAM_MJPEG2SD/webServer.cpp
  char* wsJson = (char*)malloc(reqLen + 1);
  if (!wsJson) {
    LOG_WRN("Failed to allocate memory for wsJson");
    return false;
  }

  snprintf(wsJson, reqLen + 1, "{\"type\":\"%s\",\"payload\":{%s}}", dataType, wsData);
  bool res = wsAsyncSendText(wsJson);
  free(wsJson);
  return res;
}

void wsAsyncSendBinary(uint8_t* data, size_t len) {
  // websockets send binary function, used for app specific features
  if (checkWsSocketStatus()) {
    if (data == NULL || len == 0) {
      LOG_WRN("Invalid data or length: data=%p, len=%u", data, len);
      return;
    }
    // send if connection active
    httpd_ws_frame_t wsPkt;
    memset(&wsPkt, 0, sizeof(httpd_ws_frame_t)); // Initialize all fields to zero
    wsPkt.type = HTTPD_WS_TYPE_BINARY;
    wsPkt.payload = data;
    wsPkt.len = len;
    esp_err_t ret = httpd_ws_send_frame_async(httpServer, fdWs, &wsPkt);
    if (ret != ESP_OK) LOG_WRN("websocket send failed with %s", esp_err_to_name(ret));
  } // else ignore
}

static esp_err_t wsHandler(httpd_req_t *req) {
  // receive websocket data and determine response
  // if a new connection is received, the old connection is closed, but the browser
  // page on the newer connection may need to be manually refreshed to take over the log
  esp_err_t ret = ESP_OK;
  if (req->method == HTTP_GET) {
    if (!checkAuth(req)) return ESP_OK;
    // websocket connection request from browser client
    if (fdWs != -1) {
      if (fdWs != httpd_req_to_sockfd(req)) {
        // websocket connection from browser when another browser connection is active
        LOG_VRB("closing connection, as newer Websocket on %u", httpd_req_to_sockfd(req));
        // kill older connection
        killSocket();
      }
    }
    fdWs = httpd_req_to_sockfd(req);
    if (fdWs < 0) {
      LOG_WRN("failed to get socket number");
      ret = ESP_FAIL;
    } else LOG_VRB("Websocket connection: %d", fdWs);
  } else {
    // data content received
    httpd_ws_frame_t wsPkt;
    uint8_t wsMsg[MAX_PAYLOAD_LEN];
    memset(&wsPkt, 0, sizeof(httpd_ws_frame_t));
    wsPkt.payload = wsMsg;
    ret = httpd_ws_recv_frame(req, &wsPkt, MAX_PAYLOAD_LEN);
    if (ret == ESP_OK) {
      if (wsPkt.len >= MAX_PAYLOAD_LEN) {
        LOG_ERR("websocket payload too long %d", wsPkt.len);
        return ESP_FAIL;
      }
      wsMsg[wsPkt.len] = 0; // terminator
      if (wsPkt.type == HTTPD_WS_TYPE_BINARY && wsPkt.len) appSpecificWsBinHandler(wsMsg, wsPkt.len);
      else if (wsPkt.type == HTTPD_WS_TYPE_TEXT) appSpecificWsHandler((const char*)wsMsg);
      else if (wsPkt.type == HTTPD_WS_TYPE_CLOSE) appSpecificWsHandler("X");
    } else LOG_ERR("websocket receive failed with %s", esp_err_to_name(ret));
  }
  return ret;
}

void killSocket(int skt) {
  // user requested
  if (skt == -99) {
    skt = fdWs;
    fdWs = -1;
  }
  if (skt >= 0) httpd_sess_trigger_close(httpServer, skt);
}

/*
static void https_server_user_callback(esp_https_server_user_cb_arg_t *user_cb) {
  LOG_DBG("Session created, socket: %d", user_cb->tls->sockfd);
}
*/

static esp_err_t customOrNotFoundHandler(httpd_req_t *req, httpd_err_code_t err) {
  // either handle WebDAV methods or report non existent URI
#if INCLUDE_WEBDAV
  if (strncmp(req->uri, WEBDAV, (sizeof(WEBDAV) - 1)) == 0) return handleWebDav(req) ? ESP_OK : ESP_FAIL;
#endif
  if (req->method == HTTP_OPTIONS) return sendCrossOriginHeader(req);
  // For any other URI send 404 and close socket
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

bool startWebServer() {
  esp_err_t res = ESP_FAIL;
  chunk = psramFound() ? (byte*)ps_malloc(CHUNKSIZE) : (byte*)malloc(CHUNKSIZE);
#if INCLUDE_CERTS
  if (useHttps) {
    // HTTPS server
    httpd_ssl_config_t config = HTTPD_SSL_CONFIG_DEFAULT();
#if CONFIG_IDF_TARGET_ESP32S3
    config.httpd.stack_size = SERVER_STACK_SIZE;
#endif
    config.prvtkey_pem = (const uint8_t*)serverCerts[0];
    config.prvtkey_len = strlen(serverCerts[0]) + 1;
    config.servercert = (const uint8_t*)serverCerts[1];
    config.servercert_len = strlen(serverCerts[1]) + 1;

    //config.user_cb = https_server_user_callback;
    config.httpd.server_port = HTTPS_PORT;
    config.httpd.lru_purge_enable = true; // close least used socket
    config.httpd.max_uri_handlers = MAX_HANDLERS;
    config.httpd.max_open_sockets = HTTP_CLIENTS + MAX_STREAMS;
    config.httpd.task_priority = HTTP_PRI;
    res = httpd_ssl_start(&httpServer, &config);
  } else {
#else
  if (!useHttps) {
#endif
    // HTTP server
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
#if CONFIG_IDF_TARGET_ESP32S3
    config.stack_size = SERVER_STACK_SIZE;
#endif
    config.server_port = HTTP_PORT;
    config.lru_purge_enable = true;
    config.max_uri_handlers = MAX_HANDLERS;
    config.max_open_sockets = HTTP_CLIENTS + MAX_STREAMS;
    config.task_priority = HTTP_PRI;
    res = httpd_start(&httpServer, &config);
  }
  httpd_uri_t indexUri = {.uri = "/", .method = HTTP_GET, .handler = indexHandler, .user_ctx = NULL};
  httpd_uri_t webUri = {.uri = "/web", .method = HTTP_GET, .handler = webHandler, .user_ctx = NULL};
  httpd_uri_t controlUri = {.uri = "/control", .method = HTTP_GET, .handler = controlHandler, .user_ctx = NULL};
  httpd_uri_t updateUri = {.uri = "/update", .method = HTTP_POST, .handler = updateHandler, .user_ctx = NULL};
  httpd_uri_t statusUri = {.uri = "/status", .method = HTTP_GET, .handler = statusHandler, .user_ctx = NULL};
  httpd_uri_t uploadUri = {.uri = "/upload", .method = HTTP_POST, .handler = uploadHandler, .user_ctx = NULL};
  httpd_uri_t wifiUri = {.uri = "/wifi", .method = HTTP_GET, .handler = setupHandler, .user_ctx = NULL};
  httpd_uri_t sseUri = {.uri = "/sse", .method = HTTP_GET, .handler = sseHandler, .user_ctx = NULL};
  httpd_uri_t wsUri = {.uri = "/ws", .method = HTTP_GET, .handler = wsHandler, .user_ctx = NULL, .is_websocket = true};
  httpd_uri_t sustainUri = {.uri = "/sustain", .method = HTTP_GET, .handler = appSpecificSustainHandler, .user_ctx = NULL};
  httpd_uri_t checkUri = {.uri = "/sustain", .method = HTTP_HEAD, .handler = appSpecificSustainHandler, .user_ctx = NULL};

  if (res == ESP_OK) {
    httpd_register_uri_handler(httpServer, &indexUri);
    httpd_register_uri_handler(httpServer, &webUri);
    httpd_register_uri_handler(httpServer, &controlUri);
    httpd_register_uri_handler(httpServer, &updateUri);
    httpd_register_uri_handler(httpServer, &statusUri);
    httpd_register_uri_handler(httpServer, &uploadUri);
    httpd_register_uri_handler(httpServer, &sseUri);
    httpd_register_uri_handler(httpServer, &wifiUri);
    httpd_register_uri_handler(httpServer, &wsUri);
    httpd_register_uri_handler(httpServer, &sustainUri);
    httpd_register_uri_handler(httpServer, &checkUri);
    httpd_register_err_handler(httpServer, HTTPD_404_NOT_FOUND, customOrNotFoundHandler);

    LOG_INF("Starting web server on port: %u", useHttps ? HTTPS_PORT : HTTP_PORT);
    LOG_INF("Remote server certificates %s checked", useSecure ? "are" : "not");
    if (DEBUG_MEM) {
      uint32_t freeStack = (uint32_t)uxTaskGetStackHighWaterMark(NULL);
      LOG_INF("Task httpServer stack space %u", freeStack);
    }
  } else snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Failed to start webserver %s",espErrMsg(res));
  if (!DBG_ON) esp_log_level_set("*", ESP_LOG_NONE); // suppress ESP_LOG_ERROR messages
  debugMemory("startWebserver");
  if (startupFailure[0] != '\0') {
    LOG_WRN("%s", startupFailure);
    return false;
  }
  return true;
}
